# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [3]:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")

data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [7]:
# Run the head of your data set here:

import pandas as pd
import numpy as np

data = pd.read_csv("titanic.csv")

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
# check for duplicates

print( "duplicates:"), data.duplicated().sum()

duplicates:

(None, np.int64(107))

In [10]:
# if there are, go ahead and drop them:
data = data.drop_duplicates()

print("duplicates removed:", data.duplicated().sum())

duplicates removed: 0

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we workthrough this notebook. Applologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data in tact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data. 
1. Intitalize it using the groupby() function and pass it the column.

In [22]:
# Code your groupby "embark_town" here:

embark_town = data.groupby('embark_town')

In [13]:
# To view the grouped data as a table, use the variable_name.first():

print(embark_town.first())

             survived  pclass     sex   age  sibsp  parch     fare embarked  \
embark_town
Cherbourg           1       1  female  38.0      1      0  71.2833        C
Queenstown          0       3    male   2.0      0      0   8.4583        Q
Southampton         0       3    male  22.0      1      0   7.2500        S

             class    who  adult_male deck alive  alone
embark_town
Cherbourg    First  woman       False    C   yes  False
Queenstown   Third    man        True    C    no   True
Southampton  Third    man        True    C    no  False

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [18]:
# Code your groupby "survived" table here:

the_survived = data.groupby('survived')

# run your table below:
survived_list = the_survived.describe()

In [19]:
# run your table with describe
print(survived_list)

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         461.0  2.481562  0.770507  1.0  2.0  3.0  3.0  3.0  394.0
1         323.0  1.904025  0.856152  1.0  1.0  2.0  3.0  3.0  284.0

                     ... parch        fare                                     \
               mean  ...   75%  max  count       mean        std  min     25%
survived             ...
0         30.953046  ...   0.0  6.0  461.0  23.944531  33.336385  0.0   7.875
1         28.365915  ...   1.0  5.0  323.0  50.079180  68.009971  0.0  12.825


            50%       75%       max
survived
0         13.00  26.55000  263.0000
1         26.25  61.37915  512.3292

[2 rows x 40 columns]

In [9]:
# How is this table organized?  Why are there 40 columns now?
# It's organized and by a statistical table. 
# There are 8 statistical measures and the titan dataset has 5 numerical columns. So the math
# calculation is 5x8=40

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to method chain **head()** and **agg()** togehter.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [44]:
# Code your method chain here:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")

method_chain = data.head().agg("first")

print(method_chain)

method_chain_mode = data.head().agg("mode")

print(method_chain_mode)

TypeError: NDFrame.first() missing 1 required positional argument: 'offset'

In [61]:
# # Create a variable to method chain head() with agg("sum")

# run your table:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")

method_chain = data.head().agg("sum")

print(method_chain)

In [54]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an orgainzation system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this orgainzational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"name1": 555-5557}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across muliple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a tempate for the aggregations we want to preform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine.  Making a subset table.  

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [63]:
# Predict the table output before you uncomment the code below.

age_dictionary={"age":["sum", "max"]}
dictionary_agg=data.agg(age_dictionary)
print(dictionary_agg)

          age
sum  21205.17
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [65]:
# Code your dictionary here:

import pandas as pd
data= pd.read_csv("titanic.csv")

dictionary_agg = {'survived': ['sum', 'count'], 'age': ['std', 'min'], 'sibsp': ['count', 'sum']}

agg_data = data.agg(dictionary_agg)

print(dictionary_agg)

{'survived': ['sum', 'count'], 'age': ['std', 'min'], 'sibsp': ['count', 'sum']}

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [67]:
# Code your groupby here:



# Run your table using first() here instead of head():


import pandas as pd

data= pd.read_csv("titanic.csv")

groupby_pclass = data.groupby('pclass')

first_run = groupby_pclass.first()

print(first_run)

        survived     sex   age  sibsp  parch     fare embarked   class    who  \
pclass
1              1  female  38.0      1      0  71.2833        C   First  woman
2              1  female  14.0      1      0  30.0708        C  Second  child
3              0    male  22.0      1      0   7.2500        S   Third    man

        adult_male deck  embark_town alive  alone
pclass
1            False    C    Cherbourg   yes  False
2            False    D    Cherbourg   yes  False
3             True    G  Southampton    no  False

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [82]:
import pandas as pd
import numpy as np
data = pd.read_csv("titanic.csv")
groupby_pclass = data.groupby('pclass')


# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.

agg_definitions = {
    **{col: numeric_funcs for col in data.select_dtypes(include=[np.number]).columns},
    **{col: ['first', 'last'] for col in data.columns if col not in data.select_dtypes(include=[np.number]).columns}}
agg_data = groupby_pclass.agg(agg_definitions)


print(agg_data)

       survived                                                    pclass  \
            sum      mean median min max       std       var count    sum
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281   216    216
2            87  0.472826    0.0   0   1  0.500623  0.250624   184    368
3           119  0.242363    0.0   0   1  0.428949  0.183998   491   1473

             ... adult_male        deck       embark_town              alive  \
       mean  ...      first  last first last        first         last first
pclass       ...
1       1.0  ...      False  True     C    C    Cherbourg    Cherbourg   yes
2       2.0  ...      False  True     D    E    Cherbourg  Southampton   yes
3       3.0  ...       True  True     G    E  Southampton   Queenstown    no

             alone
       last  first  last
pclass
1       yes  False  True
2        no  False  True
3        no  False  True

[3 rows x 66 columns]

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to preform on that column.  The code would look like this:

In [89]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
# passenger_class.agg(agg_func_dict)

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [88]:
# Code it here:

import pandas as pd

data = pd.read_csv("titanic.csv")

passenger_class = data.groupby('pclass')

agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
agg_data = passenger_class.agg(agg_func_dict)  

print(agg_data)

            age                                                             \
            sum       mean median   min   max        std         var first
pclass
1       7111.42  38.233441   37.0  0.92  80.0  14.802856  219.124543  38.0
2       5168.83  29.877630   29.0  0.67  70.0  14.001077  196.030152  14.0
3       8924.92  25.140620   24.0  0.42  74.0  12.495398  156.134976  22.0


        last count
pclass
1       26.0   186
2       27.0   173
3       32.0   355

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

In the box below:
1. Create a new column by manipulating the values of different column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  [This website](https://www.in2013dollars.com/uk/inflation/1912) can help you find the 2021 fare amount.

In [91]:
# Code your new "fare_2021" column here:

# Run the head of your table to see your new column:

import pandas as pd

data = pd.read_csv("titanic.csv")

inflation = 143.15

data['fare_2021'] = data['fare'] * inflation

print(data)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone     fare_2021
0      man        True  NaN  Southampton    no  False   1037.837500
1    woman       False    C    Cherbourg   yes  False  10204.204395
2    woman       False  NaN  Southampton   yes   True   1134.463750
3    woman       False    C  Southampton   yes  False   7601.265000
4      man        True  NaN  Southampton    no   True   1152.357500
..     ...         ...  ...          ...   ...    ...           ...
886    man        True  NaN  Southampton    no   True   1860.950000
887  woman       False    B  Southampton   yes   True   4294.500000
888  woman       False  NaN  Southampton    no  False   3356.867500
889    man        True    C    Cherbourg   yes   True   4294.500000
890    man        True  NaN   Queenstown    no   True   1109.412500

[891 rows x 16 columns]

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the values in the "alive" coloum from string "yes" or "no" to bools, where "yes" becomes True and "no" becomes False.

In [92]:
# Code your updated values here:
import pandas as pd
data = pd.read_csv("titanic.csv")

data['alive'] = data['alive'].replace({'yes': True, 'no': False})

print(data)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town  alive  alone
0      man        True  NaN  Southampton  False  False
1    woman       False    C    Cherbourg   True  False
2    woman       False  NaN  Southampton   True   True
3    woman       False    C  Southampton   True  False
4      man        True  NaN  Southampton  False   True
..     ...         ...  ...          ...    ...    ...
886    man        True  NaN  Southampton  False   True
887  woman       False    B  Southampton   True   True
888  woman       False  NaN  Southampton  False  False
889    man        True    C    Cherbourg   True   True
890    man        True  NaN   Queenstown  False   True

[891 rows x 15 columns]

C:\Users\charl\AppData\Local\Temp\ipykernel_23220\1303102112.py:5: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['alive'] = data['alive'].replace({'yes': True, 'no': False})

We can also use functions to update values.

1. Create a function that will set the alive values as bools. Apply it to your table and run your table here:

In [96]:
# Code your function here:
import pandas as pd
data = pd.read_csv("titanic.csv")

# function
def boolean(x):
    if x == 'yes':
        return True
    elif x == 'no':
        return False
    else:
        return x 

data['alive'] = data['alive'].apply(boolean)

print(data)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town  alive  alone
0      man        True  NaN  Southampton  False  False
1    woman       False    C    Cherbourg   True  False
2    woman       False  NaN  Southampton   True   True
3    woman       False    C  Southampton   True  False
4      man        True  NaN  Southampton  False   True
..     ...         ...  ...          ...    ...    ...
886    man        True  NaN  Southampton  False   True
887  woman       False    B  Southampton   True   True
888  woman       False  NaN  Southampton  False  False
889    man        True    C    Cherbourg   True   True
890    man        True  NaN   Queenstown  False   True

[891 rows x 15 columns]

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [22]:
# Write your max age check here:

In [23]:
# Code the new "age_group" column function here:

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. What order would we want? ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [98]:
# Code your sort_values here:

# Run your table here:

import pandas as pd
data = pd.read_csv("titanic.csv")

data_sort = data.sort_values(by='fare', ascending=False)

print(data_sort)

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
679         1       1    male  36.0      0      1  512.3292        C   First
258         1       1  female  35.0      0      0  512.3292        C   First
737         1       1    male  35.0      0      0  512.3292        C   First
88          1       1  female  23.0      3      2  263.0000        S   First
438         0       1    male  64.0      1      4  263.0000        S   First
..        ...     ...     ...   ...    ...    ...       ...      ...     ...
806         0       1    male  39.0      0      0    0.0000        S   First
815         0       1    male   NaN      0      0    0.0000        S   First
466         0       2    male   NaN      0      0    0.0000        S  Second
481         0       2    male   NaN      0      0    0.0000        S  Second
822         0       1    male  38.0      0      0    0.0000        S   First

       who  adult_male deck  embark_town alive  alone
679    man        True    B    Cherbourg   yes  False
258  woman       False  NaN    Cherbourg   yes   True
737    man        True    B    Cherbourg   yes   True
88   woman       False    C  Southampton   yes  False
438    man        True    C  Southampton    no  False
..     ...         ...  ...          ...   ...    ...
806    man        True    A  Southampton    no   True
815    man        True    B  Southampton    no   True
466    man        True  NaN  Southampton    no   True
481    man        True  NaN  Southampton    no   True
822    man        True  NaN  Southampton    no   True

[891 rows x 15 columns]

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [99]:
# Code your pivot_table here:
# Run your table here:

import pandas as pd
import numpy as np
data = pd.read_csv("titanic.csv")

bins = [0, 19, 29, 39, 49, 59, 69, 79, 89, 99]
labels = ['0-19', '20-29', '30-39', '40-49', '50-59', '60-69', '70-79', '80-89', '90-99']
data['age_group'] = pd.cut(data['age'], bins=bins, labels=labels, right=False)

pivot_table = data.pivot_table(values='fare', index=['who', 'age_group'], columns='survived', aggfunc=np.sum)

print(pivot_table)

survived                 0          1
who   age_group
child 0-19       1109.5459  1611.6751
      20-29         0.0000     0.0000
      30-39         0.0000     0.0000
      40-49         0.0000     0.0000
      50-59         0.0000     0.0000
      60-69         0.0000     0.0000
      70-79         0.0000     0.0000
      80-89         0.0000     0.0000
      90-99         0.0000     0.0000
man   0-19        515.3334   126.9833
      20-29      2702.2745   640.3584
      30-39      1586.9788  1738.1667
      40-49      1115.1041   328.5709
      50-59       943.4375   372.2334
      60-69       607.2375    89.7000
      70-79       181.1834     0.0000
      80-89         0.0000    30.0000
      90-99         0.0000     0.0000
woman 0-19        126.1375  1027.9250
      20-29       373.2125  2440.4417
      30-39       136.0417  3310.3708
      40-49       301.6542  1790.5667
      50-59        39.2125  1284.7417
      60-69         0.0000   242.7958
      70-79         0.0000     0.0000
      80-89         0.0000     0.0000
      90-99         0.0000     0.0000

C:\Users\charl\AppData\Local\Temp\ipykernel_23220\3601687223.py:18: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_table = data.pivot_table(values='fare', index=['who', 'age_group'], columns='survived', aggfunc=np.sum)
C:\Users\charl\AppData\Local\Temp\ipykernel_23220\3601687223.py:18: FutureWarning: The provided callable <function sum at 0x0000020BD160B100> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pivot_table = data.pivot_table(values='fare', index=['who', 'age_group'], columns='survived', aggfunc=np.sum)

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [100]:
# Code your table here:
import pandas as pd
data = pd.read_csv("titanic.csv")

# Run your table here:
pivot_table = data.pivot_table(index=data.index, columns='who', values='pclass', aggfunc='first')
print(pivot_table)

# Answer the question here:

# How does this table differ from the pivot_table above?
# table 1 has aggregates data showing statistical  analysis and higher level insights
# table 2 list individual records or catergorization without summarizing
# table 1 use multi-level index
# table 2 has a simple flat index
# table 1 ensures every cell is filled with relevant agg. fare data
# table 2 includes many NaN values due to its structure

who  child  man  woman
0      NaN  3.0    NaN
1      NaN  NaN    1.0
2      NaN  NaN    3.0
3      NaN  NaN    1.0
4      NaN  3.0    NaN
..     ...  ...    ...
886    NaN  2.0    NaN
887    NaN  NaN    1.0
888    NaN  NaN    3.0
889    NaN  1.0    NaN
890    NaN  3.0    NaN

[891 rows x 3 columns]

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does **melt** to the data?

In [27]:
# What does melt do?
# It's use for data transformation for analysis and flexibility in data manipulation

2. Melt to your data.  Be sure to store the output in a new variable.  What is the new shape of your table?

In [102]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)

# Run your table here:

# Check the shape of your new table.
import pandas as pd
data = pd.read_csv("titanic.csv")

melt_data = pd.melt(data)
print(melt_data.head())

print("Melted Table:", melt_data.shape)

   variable value
0  survived     0
1  survived     1
2  survived     1
3  survived     1
4  survived     0
Melted Table: (13365, 2)

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [103]:
# Create your melt table here:

# Run your table here:

# Check the shape

import pandas as pd
data = pd.read_csv("titanic.csv")

melt_data = pd.melt(data, id_vars=['embarked'], value_vars=['fare', 'deck'], var_name='Variable', value_name='Value')
print(melt_data.head())

print("Melted Table:", melt_data.shape)

  embarked Variable    Value
0        S     fare     7.25
1        C     fare  71.2833
2        S     fare    7.925
3        S     fare     53.1
4        S     fare     8.05
Melted Table: (1782, 3)

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?